* terraform layout
#+DATE: Friday, Dec 16 2022


** Layout
  #+begin_src bash :results drawer
  tree -L 2 .
  #+end_src

  #+RESULTS:
  :results:
  .
  |-- ReadME.org
  |-- environments
  |   |-- production
  |   |-- qa
  |   `-- staging
  `-- modules
      |-- api
      |-- cache
      |-- database
      `-- network

  9 directories, 1 file
  :end:

*** Notes
  - */environments* folder
    - PROs: easy to make changes specific to environment
      - just need to go env specific folder and make modifications
    - CONs:
      - env can diverse(go different direction) easily

** Branching
   - main is stable branch
     - create your branch and send a pr
     - pr preview be available on PR via github actions or similar

** Shared resources
  Shared resource across environments can configured inside environments
